/* automatically generated by rust-bindgen 0.71.1 */

pub const s1cMAX: u32 = 127;
pub const s1cMIN: i32 = -127;
pub const s2cMAX: u32 = 32767;
pub const s2cMIN: i32 = -32767;
pub const s4cMAX: u32 = 2147483647;
pub const s4cMIN: i32 = -2147483647;
pub type u1c = u8;
pub type s1c = i8;
pub type u2c = u16;
pub type s2c = i16;
pub type u4c = u32;
pub type s4c = i32;
pub type u8c = u64;
pub type s8c = i64;
#[repr(C)]
#[derive(Copy, Clone)]
pub union u4cOrPointer {
	pub num: u4c,
	pub ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of u4cOrPointer"][::std::mem::size_of::<u4cOrPointer>() - 4usize];
	["Alignment of u4cOrPointer"][::std::mem::align_of::<u4cOrPointer>() - 4usize];
	["Offset of field: u4cOrPointer::num"][::std::mem::offset_of!(u4cOrPointer, num) - 0usize];
	["Offset of field: u4cOrPointer::ptr"][::std::mem::offset_of!(u4cOrPointer, ptr) - 0usize];
};
impl Default for u4cOrPointer {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
pub type ByondValueType = u1c;
#[repr(C)]
#[derive(Copy, Clone)]
pub union ByondValueData {
	#[doc = "!< 4-byte reference ID"]
	pub ref_: u4c,
	#[doc = "!< floating-point number"]
	pub num: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ByondValueData"][::std::mem::size_of::<ByondValueData>() - 4usize];
	["Alignment of ByondValueData"][::std::mem::align_of::<ByondValueData>() - 4usize];
	["Offset of field: ByondValueData::ref_"]
		[::std::mem::offset_of!(ByondValueData, ref_) - 0usize];
	["Offset of field: ByondValueData::num"][::std::mem::offset_of!(ByondValueData, num) - 0usize];
};
impl Default for ByondValueData {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CByondValue {
	#[doc = "!< 1-byte intrinsic data type"]
	pub type_: ByondValueType,
	#[doc = "!< padding"]
	pub junk1: u1c,
	#[doc = "!< padding"]
	pub junk2: u1c,
	#[doc = "!< padding"]
	pub junk3: u1c,
	#[doc = "!< 4-byte reference ID or floating point number"]
	pub data: ByondValueData,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CByondValue"][::std::mem::size_of::<CByondValue>() - 8usize];
	["Alignment of CByondValue"][::std::mem::align_of::<CByondValue>() - 4usize];
	["Offset of field: CByondValue::type_"][::std::mem::offset_of!(CByondValue, type_) - 0usize];
	["Offset of field: CByondValue::junk1"][::std::mem::offset_of!(CByondValue, junk1) - 1usize];
	["Offset of field: CByondValue::junk2"][::std::mem::offset_of!(CByondValue, junk2) - 2usize];
	["Offset of field: CByondValue::junk3"][::std::mem::offset_of!(CByondValue, junk3) - 3usize];
	["Offset of field: CByondValue::data"][::std::mem::offset_of!(CByondValue, data) - 4usize];
};
impl Default for CByondValue {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CByondXYZ {
	#[doc = "!< signed 2-byte integer coordinates"]
	pub x: s2c,
	#[doc = "!< signed 2-byte integer coordinates"]
	pub y: s2c,
	#[doc = "!< signed 2-byte integer coordinates"]
	pub z: s2c,
	#[doc = "!< padding"]
	pub junk: s2c,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CByondXYZ"][::std::mem::size_of::<CByondXYZ>() - 8usize];
	["Alignment of CByondXYZ"][::std::mem::align_of::<CByondXYZ>() - 2usize];
	["Offset of field: CByondXYZ::x"][::std::mem::offset_of!(CByondXYZ, x) - 0usize];
	["Offset of field: CByondXYZ::y"][::std::mem::offset_of!(CByondXYZ, y) - 2usize];
	["Offset of field: CByondXYZ::z"][::std::mem::offset_of!(CByondXYZ, z) - 4usize];
	["Offset of field: CByondXYZ::junk"][::std::mem::offset_of!(CByondXYZ, junk) - 6usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CByondPixLoc {
	#[doc = "!< pixel coordinates as floats"]
	pub x: f32,
	#[doc = "!< pixel coordinates as floats"]
	pub y: f32,
	#[doc = "!< signed 2-byte integer coordinates"]
	pub z: s2c,
	#[doc = "!< padding"]
	pub junk: s2c,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of CByondPixLoc"][::std::mem::size_of::<CByondPixLoc>() - 12usize];
	["Alignment of CByondPixLoc"][::std::mem::align_of::<CByondPixLoc>() - 4usize];
	["Offset of field: CByondPixLoc::x"][::std::mem::offset_of!(CByondPixLoc, x) - 0usize];
	["Offset of field: CByondPixLoc::y"][::std::mem::offset_of!(CByondPixLoc, y) - 4usize];
	["Offset of field: CByondPixLoc::z"][::std::mem::offset_of!(CByondPixLoc, z) - 8usize];
	["Offset of field: CByondPixLoc::junk"][::std::mem::offset_of!(CByondPixLoc, junk) - 10usize];
};
pub type ByondCallback = ::std::option::Option<
	unsafe extern "C-unwind" fn(arg1: *mut ::std::os::raw::c_void) -> CByondValue,
>;
pub struct ByondApi {
	__library: ::libloading::Library,
	pub Byond_LastError: unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char,
	pub Byond_GetVersion: unsafe extern "C-unwind" fn(version: *mut u4c, build: *mut u4c),
	pub Byond_GetDMBVersion: unsafe extern "C-unwind" fn() -> u4c,
	pub ByondValue_Clear: unsafe extern "C-unwind" fn(v: *mut CByondValue),
	pub ByondValue_Type: unsafe extern "C-unwind" fn(v: *const CByondValue) -> ByondValueType,
	pub ByondValue_IsNull: unsafe extern "C-unwind" fn(v: *const CByondValue) -> bool,
	pub ByondValue_IsNum: unsafe extern "C-unwind" fn(v: *const CByondValue) -> bool,
	pub ByondValue_IsStr: unsafe extern "C-unwind" fn(v: *const CByondValue) -> bool,
